       program-id. main.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           
           goback.

       end program main.
